Revit 2026 API

# ElectricalAnalyticalLoadSetQuantityOnStandBy Property

---

The number of Equipment Loads that are not operational at any time.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int QuantityOnStandBy { get; set; }
```
```vb
Public Property QuantityOnStandBy As Integer
	Get
	Set
```
```cpp
public:
property int QuantityOnStandBy {
	int get ();
	void set (int value);
}
```
```fsharp
member QuantityOnStandBy : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The number is greater than the total count of the Equipment Loads in the LoadSet. |
| ArgumentOutOfRangeException | When setting this property: The given value for number is negative. |

The equipment loads with smaller load value within the set are considered on standby. Must be between 0 and (total count of the Equipment Loads in the LoadSet)

#### Reference

ElectricalAnalyticalLoadSet Class

Autodesk.Revit.DB.Electrical Namespace